       IDENTIFICATION DIVISION.
       PROGRAM-ID. SISTEMA-BANCARIO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL ARCHIVO-CUENTA ASSIGN TO "cuentas.dat"
               ORGANIZATION IS SEQUENTIAL.
           SELECT OPTIONAL ARCHIVO-TRANSACCION
           ASSIGN TO "transacciones.dat"
               ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD ARCHIVO-CUENTA.
       01  REGISTROCUENTA.
           05  ID-CUENTA          PIC 9(5).
           05  HOLDER-CUENTA      PIC X(30).
           05  BALANCE-CUENTA     PIC 9(7)V99.

       FD ARCHIVO-TRANSACCION.
       01  REGISTRO-TRANSACCION.
           05  TRANS-CUENTA-ID    PIC 9(5).
           05  TIPO-TRANS         PIC X(1).
               88 DEPOSITO          VALUE 'D'.
               88 RETIRO         VALUE 'R'.
           05  TRANS-MONTO       PIC 9(7)V99.

       WORKING-STORAGE SECTION.
       01  PROMPT-CUENTA-ID       PIC X(30)
       VALUE "INGRESA EL ID DE LA CUENTA: ".
       01  PROMPT-HOLDER-NOMBRE   PIC X(35)
       VALUE "INGRESA EL NOMBRE DEL TITULAR: ".
       01  PROMPT-MONTO           PIC X(25)
       VALUE "INGRESA EL MONTO: ".
       01  MONTO-INVALIDO         PIC X(35)
       VALUE "MONTO NO VALIDO, INTENTA DE NUEVO.".
       01  FONDOS-INSUFICIENTES   PIC X(51)
       VALUE "FONDOS INSUFICIENTES.".

       01  OPCION-USUARIO         PIC X.
       01  CUENTA-ENCONTRADA      PIC X VALUE 'N'.
       01  BUSCAR-ID-CUENTA       PIC 9(5).
       01  MONTO-TRANSACCION      PIC 9(7)V99.

       PROCEDURE DIVISION.
       LOGICA-PRINCIPAL.
           PERFORM DISPLAY-MENU
           PERFORM UNTIL OPCION-USUARIO = '5'
               PERFORM PROCESO-OPCION
               PERFORM DISPLAY-MENU
           END-PERFORM.
           STOP RUN.

       DISPLAY-MENU.
           DISPLAY "****** BANCO BUENA ONDA ******"
           DISPLAY "1. CREAR CUENTA"
           DISPLAY "2. DEPOISTAR DINERO"
           DISPLAY "3. RETIRAR DINERO"
           DISPLAY "4. CONSULTAR SALDO"
           DISPLAY "5. SALIR"
           DISPLAY "SELECCIONA UN NUMERO: "
           ACCEPT OPCION-USUARIO.

       PROCESO-OPCION.
           EVALUATE OPCION-USUARIO
               WHEN '1'
                   PERFORM CREAR-CUENTA
               WHEN '2'
                   PERFORM DEPOSITAR-DINERO
               WHEN '3'
                   PERFORM RETIRAR-DINERO
               WHEN '4'
                   PERFORM CONSULTAR-SALDO
               WHEN OTHER
                   DISPLAY "OPCION NO VALIDA, INTENTA DE NUEVO"
           END-EVALUATE.

       CREAR-CUENTA.
           OPEN EXTEND ARCHIVO-CUENTA
           DISPLAY PROMPT-CUENTA-ID
           ACCEPT ID-CUENTA
           DISPLAY PROMPT-HOLDER-NOMBRE
           ACCEPT HOLDER-CUENTA
           MOVE 0 TO BALANCE-CUENTA
           WRITE REGISTROCUENTA
           DISPLAY "CUENTA CREADA CORRECTAMENTE."
           CLOSE ARCHIVO-CUENTA.

       DEPOSITAR-DINERO.
           OPEN I-O ARCHIVO-CUENTA
           PERFORM ENCONTRAR-CUENTA
           IF CUENTA-ENCONTRADA = 'Y'
           DISPLAY PROMPT-MONTO
           ACCEPT MONTO-TRANSACCION
           IF MONTO-TRANSACCION > 0
               ADD MONTO-TRANSACCION TO BALANCE-CUENTA
               REWRITE REGISTROCUENTA
               MOVE 'D' TO TIPO-TRANS
               PERFORM REGISTRAR-TRANSACCION
               DISPLAY "DEPOSITO EXITOSO."
           ELSE
               DISPLAY MONTO-INVALIDO
           END-IF
           ELSE
               DISPLAY "CUENTA NO ENCONTRADA."
           END-IF.
           CLOSE ARCHIVO-CUENTA.

       RETIRAR-DINERO.
           OPEN I-O ARCHIVO-CUENTA
           PERFORM ENCONTRAR-CUENTA
           IF CUENTA-ENCONTRADA = 'Y'
               DISPLAY PROMPT-MONTO
               ACCEPT MONTO-TRANSACCION
               IF MONTO-TRANSACCION > 0
               AND MONTO-TRANSACCION <= BALANCE-CUENTA
                   SUBTRACT MONTO-TRANSACCION FROM BALANCE-CUENTA
                   MOVE 'R' TO TIPO-TRANS
                   PERFORM REGISTRAR-TRANSACCION
                   REWRITE REGISTROCUENTA
                   DISPLAY "RETIRO EXITOSO."
               ELSE IF MONTO-TRANSACCION > BALANCE-CUENTA
                   DISPLAY FONDOS-INSUFICIENTES
               ELSE
                   DISPLAY MONTO-INVALIDO
               END-IF
           ELSE
               DISPLAY "CUENTA NO ENCONTRADA."
           END-IF.
           CLOSE ARCHIVO-CUENTA.

       CONSULTAR-SALDO.
           OPEN I-O ARCHIVO-CUENTA
           PERFORM ENCONTRAR-CUENTA
           IF CUENTA-ENCONTRADA = 'Y'
               DISPLAY "SALDO ACTUAL: ", BALANCE-CUENTA
           ELSE
               DISPLAY "CUENTA NO ENCONTRADA."
           END-IF.
           CLOSE ARCHIVO-CUENTA.

       ENCONTRAR-CUENTA.
           MOVE 'N' TO CUENTA-ENCONTRADA
           DISPLAY PROMPT-CUENTA-ID
           ACCEPT BUSCAR-ID-CUENTA
           PERFORM UNTIL CUENTA-ENCONTRADA = 'Y'
           READ ARCHIVO-CUENTA
           AT END
               DISPLAY "CUENTA NO ENCONTRADA."
               EXIT PERFORM
           NOT AT END
               IF ID-CUENTA = BUSCAR-ID-CUENTA
                   MOVE 'Y' TO CUENTA-ENCONTRADA
               END-IF
               END-READ
           END-PERFORM.

       REGISTRAR-TRANSACCION.
           OPEN EXTEND ARCHIVO-TRANSACCION
           MOVE ID-CUENTA TO TRANS-CUENTA-ID
           MOVE MONTO-TRANSACCION TO TRANS-MONTO
           WRITE REGISTRO-TRANSACCION
           CLOSE ARCHIVO-TRANSACCION.
